import React from "react";
import "./css/about.css";
const About = () => {
    return (
        <div className="about" id="about">
        <div className="title">
            <h2>مرحبًا بك في </h2>
            <h2>CodingHub</h2>
        </div>

        <div className="description">

            <p dir="rtl">نحن نؤمن بأن البرمجة هي مفتاح الإبداع والابتكار، ولهذا أنشأنا CodingHub</p>
            <p> ليكون مجتمعًا يهدف إلى تبسيط
                مفاهيم البرمجة وتقديم محتوى تعليمي قيّم للمطورين من جميع المستويات</p>
            <p>سواء كنت مبتدئًا تسعى لدخول عالم البرمجة أو مطورًا محترفًا تبحث عن تحديات جديدة، فنحن هنا لمساعدتك في
                رحلتك. من خلال الدروس التفاعلية، والمشاريع الواقعية، والمحتوى التقني المميز، نهدف إلى بناء بيئة تعلم
                ملهمة تتيح للمبرمجين مشاركة المعرفة والتطور معًا</p>
            <p>انضم إلينا، ودعنا نبرمج المستقبل سطرًا بعد سطر</p>
        </div>
        <p dir="rtl">الكود الجيد هو الكود الذي يجعل الحياة أسهل، وليس أعقد</p>

    </div>
    )
}

export default About;